tap "chmouel/lazyworktree", "https://github.com/chmouel/lazyworktree"
tap "dicklesworthstone/tap"
tap "nkzw-tech/tap"
tap "pulumi/tap"
tap "restatedev/tap"
tap "siderolabs/tap"
tap "steipete/tap"
tap "yoanbernabeu/tap"
# Run your GitHub Actions locally
brew "act"
# Zstandard is a real-time compression algorithm
brew "zstd"
# Columnar in-memory analytics layer designed to accelerate big data
brew "apache-arrow"
# Perf monitoring CLI tool for Apple Silicon
brew "asitop"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Linux/OSX/FreeBSD resource monitor
brew "bpytop"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Cross-platform make
brew "cmake"
# Top-like interface for container metrics
brew "ctop"
# Diff that understands syntax
brew "difftastic"
# Load/unload environment variables based on $PWD
brew "direnv"
# Lightweight DNS forwarder and DHCP server
brew "dnsmasq"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Fast and simple Node.js version manager
brew "fnm"
# Terminal JSON viewer
brew "fx"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Blazing fast terminal-ui for git written in rust
brew "gitui"
# Render markdown on the CLI
brew "glow"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Fast linters runner for Go
brew "golangci-lint"
# Kubernetes package manager
brew "helm"
# Git-compatible distributed version control system
brew "jj"
# TUI for interacting with the Jujutsu version control system
brew "jjui"
# FAST Kubernetes manifests validator, with support for Custom Resources!
brew "kubeconform"
# Much more powerful alternative to kubectx and kubens
brew "kubie"
# TUI for Jujutsu/jj
brew "lazyjj"
# Asynchronous event library
brew "libev"
# Postgres C API library
brew "libpq"
# YAML Parser
brew "libyaml"
# LLM inference in C/C++
brew "llama.cpp"
# Find what models run on your hardware
brew "llmfit"
# Utility for directing compilation
brew "make"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Deep clean and optimize your Mac
brew "mole"
# Remote terminal application
brew "mosh"
# Open source relational database management system
brew "mysql-client"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Small build system for use with gyp or CMake
brew "ninja"
# OCaml package manager
brew "opam"
# AI coding agent, built for the terminal
brew "opencode"
# Drop-in replacement for Terraform. Infrastructure as Code Tool
brew "opentofu"
# Terminal multiplexer
brew "tmux"
# Process manager for Procfile-based applications and tmux
brew "overmind"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Object-relational database system
brew "postgresql@14"
# Monitor data's progress through a pipe
brew "pv"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Database of common MIME types
brew "shared-mime-info"
# Cross-shell prompt for astronauts
brew "starship"
# Easiest, most secure way to use WireGuard and 2FA
brew "tailscale"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Distributed SQL query engine for big data
brew "trino"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Execute commands when watched files change
brew "watchexec"
# Internet file retriever
brew "wget"
# Why is this running?
brew "witr"
# CLI for Git worktree management, designed for parallel AI agent workflows
brew "worktrunk"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Command-line interface for 1Password
cask "1password-cli"
cask "codexbar"
cask "codiff"
cask "lazyworktree"
# Visual diff and merge tool
cask "meld"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
vscode "anthropic.claude-code"
vscode "astral-sh.ty"
vscode "biomejs.biome"
vscode "bwya77.islands-dark"
vscode "charliermarsh.ruff"
vscode "detachhead.basedpyright"
vscode "eamodio.gitlens"
vscode "factory.factory-vscode-extension"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "monokai.theme-monokai-pro-vscode"
vscode "mquandalle.graphql"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ocamllabs.ocaml-platform"
vscode "saoudrizwan.claude-dev"
vscode "subframe7536.custom-ui-style"
vscode "tamasfe.even-better-toml"
vscode "visualjj.visualjj"
go "github.com/99designs/gqlgen"
go "github.com/tkuminecz/jj-worktrunk"
cargo "cowboy-cli"
cargo "jj-spr"
uv "batrachian-toad"
uv "claude-container", source: "file:///Users/tim/projects/claude-container"
uv "contribx", source: "file:///Users/tim/projects/contribx"
uv "copier"
uv "jujustack", source: "file:///Users/tim/projects/jujustack"
uv "mlx"
uv "pancake", source: "file:///Users/tim/projects/pancake"
uv "protobuf-to-pydantic", with: ["mypy-protobuf"]
uv "timeline", source: "file:///Users/tim/projects/timeline"
npm "firecrawl-cli"
